// 网站时间轴
export const timeAixsList = [
  {
    id: 1,
    time: "2022.10.08",
    title: "blog第一版HTML开发",
  },
  {
    id: 2,
    time: "2024.03.11",
    title: "blog第二版Vue重构",
  },
  {
    id: 3,
    time: "2024.12.18",
    title: "blog第三版NextJs重构(SSR)",
  },
];
// 职业概述
export const web_desc =
  "作为一名Web前端开发工程师，我负责设计、开发和维护Web应用程序的用户界面，使之呈现出美观、易用、高效的特性。我能够熟练运用HTML、CSS、JavaScript等前端技术和工具，同时也具备与UI设计师、后端工程师和产品经理等多个团队成员协作的能力。在我的工作中，我不断学习和跟进前沿技术和最佳实践，以提高开发效率和开发质量。";

// 技能与工具
export const skillList = [
  {
    id: 1,
    value: "编程语言：HTML、CSS、JavaScript、TypeScript",
  },
  {
    id: 2,
    value: "掌握框架：Vue2、Vue3、React、Uni-app、NextJs、Electron",
  },
  {
    id: 3,
    value: "状态工具：Vuex、Pinia、Redux",
  },
  {
    id: 4,
    value: "打包工具：Webpack、Vite",
  },
  {
    id: 5,
    value: "CSS工具：Sass、Less、TailwindCSS、UnoCSS",
  },
  {
    id: 6,
    value: "掌握组件库：ElementPlus、Vuetify、Vant、Echarts、Antv、AntDesign等",
  },
  {
    id: 7,
    value:
      "具备多端开发能力：Web端、桌面程序端、H5端、微信小程序、手机App端、SSR服务端渲染",
  },
];

// 工作经历
export const workList = [
  {
    id: 1108,
    companyName: "成都恒速科技有限公司",
    workTime: "2024.1 - 至今",
    role: "Web前端工程师",
    place: "成都",
    operatingDuty: [
      {
        id: 1,
        value:
          "湖南长沙国家电网总部基地驻场八个月，负责电网项目前端主体开发工作",
      },
      {
        id: 2,
        value: "协助其他团队成员解决技术难题和问题；",
      },
      {
        id: 3,
        value: "新建项目的基建，搭建前端框架和开发环境；",
      },
      {
        id: 4,
        value: "与设计和后端团队密切合作，确保项目的顺利进行；",
      },
    ],
  },
  {
    id: 1109,
    companyName: "四川民图科技有限公司",
    workTime: "2022.11 - 2024.1",
    role: "Web前端开发工程师",
    place: "泸州",
    operatingDuty: [
      {
        id: 1,
        value: "负责多个项目的前端开发工作，包括页面设计和交互实现",
      },
      {
        id: 2,
        value: "协助测试团队进行测试，并解决测试过程中的问题和反馈；",
      },
      {
        id: 3,
        value: "设计和开发Web前端组件，提高开发效率；",
      },
    ],
  },
];

// 项目经验
export const projectList = [
  {
    id: 1103,
    projectName: "中治赛迪-线棒材轧制数字化系统",
    projectTime: "2024.11 - 至今",
    desc: "中治赛迪(世界500强企业)工业生产线棒材轧制数字化系统，集齐计算展示、模拟分析和后台管理于一体的工业生产系统",
    lectotype:
      "Vue3 + Pinia + Vite + Vuetify + ElementPlus + Echarts + TailwindCSS",
    jobOrContribute: [
      {
        id: 1,
        value: "独立负责整个项目技术选型与框架搭建，负责全部前端开发工作",
      },
      {
        id: 2,
        value:
          "项目包括铸轧温度演变、全线温度演变、孔型轧制计算、减定径计算、钢性能预报以及材料参数等模块，包含数据可视化展示、动态表头表单、流程组件拖拽等功能",
      },
      {
        id: 3,
        value: "封装二级页面配置组件，统一处理各种业务，提供二级页快速搭建能力",
      },
    ],
    projectResults: [
      {
        id: 2,
        value: "超前完成项目开发，使业务能如期交付测试，能够提前排查各种问题",
      },
      {
        id: 3,
        value:
          "完美还原UI设计，并在此基础上美化和统一风格，使用户的视觉体验更佳",
      },
      {
        id: 4,
        value: "代码的可维护性，为后续开发人员提供了很大的便利。",
      },
    ],
  },
  {
    id: 1102,
    projectName: "中治赛迪-钢铁服务低碳平台官网及其后台管理系统",
    projectTime: "2024.10 - 2025.1",
    desc: "中治赛迪(世界500强企业)钢铁服务低碳平台，中国钢铁工业协会低碳工作委员会官方网站，提供及时低碳资讯、政策，提供国内外多种规则下的碳核算服务",
    lectotype: "Vue3 + Pinia + Vite + ElementPlus + Echarts",
    jobOrContribute: [
      {
        id: 1,
        value:
          "负责平台官网的SEO优化，通过合理的页面结构、关键词优化、内容优化等手段，提高网站在搜索引擎中的排名，增加网站的曝光度和流量",
      },
      {
        id: 2,
        value:
          "负责官网碳市场模块及其后台管理系统的全部开发工作，包括碳市场政策、资讯、股市行情等业务模块开发",
      },
    ],
    projectResults: [
      {
        id: 1,
        value: "显著提高了网站在搜索引擎中的关键词相关度排名，提高了网站知名度",
      },
      {
        id: 2,
        value: "短时间内完成项目开发，交付并测试功能，使客户满意",
      },
    ],
  },
  {
    id: 1113,
    projectName: "中国大熊猫保护研究基地科研管理系统",
    projectTime: "2024.10 - 2025.2",
    desc: "成都大熊猫繁育基地科研管理系统，负责全国大熊猫论文与科研成果系统管理，审核最新科研成果并进行经费相关工作管理。",
    lectotype: "Vue2 + Vuex + Element-ui",
    jobOrContribute: [
      {
        id: 1,
        value:
          "负责项目所有模块的维护和优化，包括论文管理、科研成果管理、经费管理、用户管理等模块。",
      },
      {
        id: 2,
        value:
          "负责经费支出模块各个经费类型的支出计算与金额校验，保证费用准确无误。",
      },
    ],
    projectResults: [
      {
        id: 1,
        value: "高效维护使整个系统稳定运行，并在此基础上拓展了手机端业务。",
      },
    ],
  },
  {
    id: 1114,
    projectName: "成都大学科研管理系统",
    projectTime: "2024.10 - 2025.2",
    desc: "成都大学学校内部科研管理系统，包括学校科研项目的管理，包括项目申请、项目进度、项目成果等模块。",
    lectotype: "Vue2 + Vuex + Element-ui",
    jobOrContribute: [
      {
        id: 1,
        value: "负责项目所有模块的维护和调整开发。",
      },
      {
        id: 2,
        value:
          "负责升级重构权限管理模块，新添大量特殊角色并进行独特权限分配，使系统权限管理更加精细。",
      },
      {
        id: 3,
        value:
          "参与核心功能模块的开发，解决了一些复杂的数据交互和前后端接口的稳定性问题。",
      },
    ],
    projectResults: [
      {
        id: 1,
        value: "通过优化系统性能，提升了加载速度，确保了系统的高效运行。",
      },
    ],
  },
  {
    id: 1112,
    projectName: "湖南省国家电网微信机器人后台管理系统",
    projectTime: "2024.2 - 2024.10",
    desc: "长沙国家电网子公司内网开发项目，通过接入微信接口，进行微信消息的接收和发送，后台配置居民用电相关话术与政策文件，实现自动回复与预警上报，以及用户管理、权限管理等功能。项目采用电网公司多年迭代的内部架构搭建。",
    lectotype: "Vue2 + Node.js + 内部组件库",
    jobOrContribute: [
      {
        id: 1,
        value:
          "全权负责项目首页开发，包括数据可视化展示、图表交互、数据请求等，搜集整个项目的关键数据，确保数据准确性和图表的动态更新。",
      },
      {
        id: 2,
        value:
          "负责话术管理模块以及暗语模块的开发，包括话术的增删改查、话术分类管理、话术审核以及合并等功能，实现消息准确匹配和自动回复。",
      },
      {
        id: 3,
        value:
          "负责风险预警模块的开发，包括预警信息的管理、预警级别管理、预警审核以及预警推送等功能，实现预警信息的及时上报和推送。",
      },
      {
        id: 4,
        value:
          "负责用户管理模块以及权限模块的开发，包括用户信息管理、用户权限管理、用户角色管理等功能，实现用户身份认证和从省级市级县级到所级的权限控制。",
      },
      {
        id: 5,
        value:
          "负责项目模块功能按钮级权限的配置，实现不同用户角色对应不同功能权限，保证数据安全性，以确保符合国家电网数据安全标准。",
      },
    ],
    projectResults: [
      {
        id: 1,
        value:
          "通过抽离公共组件，优化代码结构，统一代码风格，大幅提高了开发效率和可维护性。",
      },
      {
        id: 2,
        value:
          "项目稳定按时上线，在湖南省内多次开展了10万人口以上的大规模推广与试点工作，得到了用户的一致好评，为公司创造了良好的口碑和收益，为后续全省推广打好了基础。",
      },
    ],
  },
  {
    id: 1104,
    projectName: "云养牛平台手机H5端",
    projectTime: "2024.1 - 2024.2",
    desc: "分为用户端和管理端，用户端用于展示养牛信息、合同签订和资金分配，管理端用于管理养牛信息，合同审核和商家关系管理。",
    lectotype: "Vue3 + Pinia + Vite + Vant + Vuetify",
    jobOrContribute: [
      {
        id: 1,
        value: "负责用户端和管理端所有模块页面的开发以及后续的联调工作",
      },
      {
        id: 2,
        value:
          "使用webpack进行项目文件目录高级管理，使双端共用一个项目文件目录进行开发并在打包时能通过路由进行区分双端入口",
      },
    ],
    projectResults: [
      {
        id: 1,
        value:
          "通过高效开发实现项目快速上线，高质量代码编写规范使bug反馈明显减少，提高了项目稳定性",
      },
    ],
  },
  {
    id: 1105,
    projectName: "剧荟广场销售智慧大屏",
    projectTime: "2023.11 - 2024.12",
    desc: "通过GoView二级开发平台实现剧荟广场数据大屏项目的快速开发于迭代",
    lectotype: "VUe3 + GoView + Echarts",
    jobOrContribute: [
      {
        id: 1,
        value:
          "基于GoView进行组件的二次封装，开发大量自定义组件可进行拖拉拽和数据联调",
      },
    ],
    projectResults: [
      {
        id: 1,
        value:
          "丰富了公司内部组件库，提供详细组件使用文档和使用示例，提高了开发效率",
      },
    ],
  },
  {
    id: 1106,
    projectName: "剧荟广场微信小程序",
    projectTime: "2023.6 - 2023.11",
    desc: "宜宾江安剧荟广场微信小程序，集合了展示各类活动信息及报名、商家及平台优惠券的发放和领取、商家入驻和商家管理、二维码订餐和支付、网上购物、会员卡充值及积分兑换以及停车场进出场开闸与计算收费等功能。",
    lectotype: "Uni-app + Vue2 + HBuilder+ 微信开发者工具",
    jobOrContribute: [
      {
        id: 1,
        value: "负责小程序所有模块页面的开发以及后续的联调工作",
      },
      {
        id: 2,
        value:
          "负责与广场停车系统对接，实现停车场进出场开闸与计算收费功能，解决分时段计费金额计算问题",
      },
      {
        id: 3,
        value:
          "负责与高拍仪系统对接，实现商家扫码支付功能、积分小票自动识别功能，解决微信支付和支付宝支付问题",
      },
      {
        id: 4,
        value:
          "负责商场各种活动的上架与优惠券的发放和领取功能，确保优惠券领取和核销的准确性和安全性",
      },
    ],
    projectResults: [
      {
        id: 1,
        value:
          "通过将停车系统接入到小程序中，提高了小程序的知名度与日活量，进一步推广了广场的影响力",
      },
      {
        id: 2,
        value:
          "通过集合多种功能，极大丰富了小程序的功能性与便捷性，提高了用户满意度",
      },
    ],
  },
  {
    id: 1107,
    projectName: "体检预约平台H5端",
    projectTime: "2023.4 - 2024.6",
    desc: "为泸州本地多家医院打造的体检预约平台，用户可以在线预约体检，查看体检报告，了解体检套餐等。",
    lectotype: "Vue2 + Vuex + uView",
    jobOrContribute: [
      {
        id: 1,
        value: "从零开始的项目开发工作",
      },
      {
        id: 2,
        value: "负责项目所有页面的搭建开发与优化",
      },
      {
        id: 3,
        value: "负责解决项目改造为微信小程序端的各种兼容性适配问题",
      },
    ],
    projectResults: [
      {
        id: 1,
        value: "项目稳定上线并上线各个医院，成为便民体检预约的重要平台",
      },
      {
        id: 2,
        value:
          "解决了大量H5端与微信小程序端兼容性问题，成功推出微信小程序版预约平台",
      },
    ],
  },
];

// 教育经历
export const schoolUndergo = [
  {
    id: 1,
    schoolName: "四川轻化工大学",
    specialityName: "轻化工程",
    education: "本科（全日制）",
    time: "2018.9-2022.6",
  },
];

// 我的项目
export const myProject = [
  {
    id: 1,
    projectName: "个人技术博客",
    projectTime: "2022.10 - 至今",
    lectotype: "Next.js, React, Ant Design, SEO, SSR",
    desc: "独立开发的技术博客平台，采用Next.js搭建，通过React与Ant Design构建模块化的组件系统，实现响应式布局，接入SEO优化和SSR服务端渲染技术，提升网站性能和用户体验。",
    jobOrAchievement:
      "完成了全部开发工作，涵盖前端页面设计、组件开发、响应式布局、SEO优化，以及SSR服务端渲染技术等。",
  },
];

// 自我评价
export const about =
  "作为一名热爱前端开发的工程师，我对技术始终保持着敬畏之心，并且不断学习新的知识和技能，以提高自己的技术水平和工作效率。我注重团队合作，乐于分享和交流，能够快速融入团队并且和其他成员良好协作，以达到共同的目标。同时，我有较强的问题解决能力和自主学习能力，在遇到挑战和困难时能够冷静应对，通过不断尝试和探索找到最优解决方案。我希望能够在未来的工作中继续发挥自己的优势，并且不断追求进步和提高。";
